{
  "backend/main.mo": "Defines the main backend actor with authorization, user profiles, hotel/ticket/trip comparison types, and profile query logic.",
  "feature_evidence.json": "Feature evidence report mapping a UI update requirement to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining global light/dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point loading the React app with the TripTally page title.",
  "frontend/src/App.tsx": "Configures the TanStack Router, global layout, theming, and top-level application routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout and profile redirection.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter their name and saving the profile.",
  "frontend/src/components/auth/UnauthSignInScreen.tsx": "Unauthenticated sign‑in screen showing branding, a fixed “Welcome to EOA” heading, and a sign‑in button.",
  "frontend/src/components/groups/ChatPanel.tsx": "Chat panel UI for displaying, scrolling, and sending messages with enter‑to‑send behavior.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with top navigation and footer, updating the document title based on routing and branding.",
  "frontend/src/components/layout/Footer.tsx": "Renders a footer with branding, current year, and a referral link to caffeine.ai.",
  "frontend/src/components/layout/TopNav.tsx": "Displays the main navigation bar with branding, route links, profile access, login, and a mobile menu.",
  "frontend/src/components/memory/PhotoGrid.tsx": "Shows a grid of photos with options to tag people or delete each photo, handling empty states and tag display.",
  "frontend/src/components/memory/PhotoUploader.tsx": "Provides an image upload interface with progress tracking and mutation-based upload handling.",
  "frontend/src/components/memory/TagPeoplePanel.tsx": "Modal panel for adding, removing, and saving manual people tags on a photo using friends or principal IDs.",
  "frontend/src/components/offers/HotelOffersEditor.tsx": "Lets users add, edit, and remove hotel listings with room and pricing details, updating the parent collection.",
  "frontend/src/components/offers/TicketOffersEditor.tsx": "UI component for adding, editing, and deleting ticket options with fields for name, type, price, and currency.",
  "frontend/src/components/offers/VipOffersEditor.tsx": "Editor for creating and managing VIP packages including price, currency, inclusions, and perks.",
  "frontend/src/components/results/BundleCard.tsx": "Displays a travel bundle’s ticket, hotel, VIP details, and total pricing with per‑person breakdown.",
  "frontend/src/components/results/BundleSortBar.tsx": "Sort bar allowing users to choose sorting options like price or hotel rating.",
  "frontend/src/components/safety/PurchaseConsentGate.tsx": "Gates purchase‑related UI behind authentication and parental consent checks with a confirmation workflow.",
  "frontend/src/config/branding.ts": "Central branding config defining app name, tagline, and logo asset paths.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook handling login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, friends, trip comparisons, albums, groups, and messaging using the actor backend.",
  "frontend/src/index.css": "Sets Tailwind CSS layers and theme variables for light and dark modes.",
  "frontend/src/lib/currency.ts": "Provides a helper to format numbers as currency using Intl.NumberFormat.",
  "frontend/src/lib/localComparisonEngine.ts": "Generates trip bundles by combining tickets, hotels, VIP packages, and room types with cost calculations.",
  "frontend/src/lib/tripWindow.ts": "Computes check-in and check-out timestamps based on a concert date and buffer days.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the app.",
  "frontend/src/pages/AlbumPage.tsx": "Displays an album with photos, allows uploading and deleting, and handles loading/error states.",
  "frontend/src/pages/GroupDetailPage.tsx": "Shows group details with chat, lets users post messages or leave the group.",
  "frontend/src/pages/GroupsPage.tsx": "Lists user groups, supports creating new groups, and handles unauthenticated access.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing branding, a hero section, feature steps, and navigation buttons to the trip builder or saved comparisons.",
  "frontend/src/pages/MemoryFinderPage.tsx": "Displays user photo albums with create‑album dialog, handling auth, loading states, and navigation to individual albums.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the user's profile info and saved trip comparisons with delete actions, including auth and loading states.",
  "frontend/src/pages/ResultsPage.tsx": "Generates and sorts travel bundles from trip data, displays bundle results, and provides save and navigation actions.",
  "frontend/src/pages/SavedComparisonsPage.tsx": "Lists saved trip comparisons with delete options, handling auth, loading, and empty states.",
  "frontend/src/pages/TripBuilderPage.tsx": "React page that captures event, travel, and offer details, manages form state, and navigates to results after validation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-stored parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugins for styling across the frontend.",
  "project_state.json": "No summary available."
}