{
  "backend/main.mo": "Defines the main backend canister with access control, ID generation, and rich types for hotels, tickets, bundles, and trip comparisons, plus user profile queries.",
  "backend/migration.mo": "Provides type definitions and structures used for migrating older trip comparison data into the updated bundle and comparison formats.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains human‑written summaries describing each frontend file’s purpose and behavior.",
  "frontend/index.css": "Tailwind CSS setup defining global light and dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global layout, auth gating, and theme provider for the React app.",
  "frontend/src/backend.idl.ts": "Defines the complete candid IDL for backend types including users, groups, messages, hotels, amenities, tickets, and comparison inputs.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a sign‑in/sign‑out button handling Internet Identity login flow, logout, navigation, and profile setup dialog.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a modal prompting new authenticated users to enter their name and saves the profile using backend mutations.",
  "frontend/src/components/auth/RequireAuth.tsx": "Protects routes by redirecting unauthenticated users to the sign‑in page while allowing initialization and public access to '/'.",
  "frontend/src/components/auth/UnauthSignInScreen.tsx": "Displays a branded sign‑in screen with messaging, error display, and Internet Identity login button.",
  "frontend/src/components/groups/ChatPanel.tsx": "Implements a chat UI with scrolling, message rendering, input handling, and send action integration.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the app’s main layout with top navigation, footer, and automatic document title updates.",
  "frontend/src/components/layout/Footer.tsx": "Renders a footer with branding, current year, and a credit link to caffeine.ai.",
  "frontend/src/components/layout/TopNav.tsx": "Displays the top navigation bar with branding, dynamic nav links based on auth state, profile access, and mobile menu.",
  "frontend/src/components/memory/PhotoGrid.tsx": "Displays a grid of photos with hover actions for tagging people and deleting, and opens a tagging panel for the selected photo.",
  "frontend/src/components/memory/PhotoUploader.tsx": "Handles image file selection and uploads photos with progress tracking and error handling.",
  "frontend/src/components/memory/TagPeoplePanel.tsx": "Modal panel for viewing, adding, and removing manual person tags on a photo, then saving updates.",
  "frontend/src/components/offers/HotelOffersEditor.tsx": "Allows adding, editing, and removing hotel entries with room and pricing details.",
  "frontend/src/components/offers/TicketOffersEditor.tsx": "Manages creation and editing of ticket offers including type, price, and currency.",
  "frontend/src/components/offers/TransportOffersEditor.tsx": "Enables adding, listing, and removing transportation options with mode, provider, class, and pricing.",
  "frontend/src/components/offers/VipOffersEditor.tsx": "UI component for creating, editing, and deleting VIPPackage entries with form handling and list display.",
  "frontend/src/components/results/BundleCard.tsx": "Displays a travel bundle with pricing, ticket, hotel, and badge indicators, including optional consent gating for purchases.",
  "frontend/src/components/results/BundleSortBar.tsx": "Provides a dropdown UI for selecting sorting options for bundles.",
  "frontend/src/components/safety/PurchaseConsentGate.tsx": "Gate component that requires authentication and parental consent before showing purchase-related content.",
  "frontend/src/config/branding.ts": "Centralized branding config defining app name, tagline, and logo assets.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated/anonymous backend actor and invalidates queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, friends, trip comparisons, and backend mutations using the actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive CSS variables for theming, including dark mode overrides and base styles.",
  "frontend/src/lib/currency.ts": "Provides a helper to format numbers as currency using Intl.NumberFormat.",
  "frontend/src/lib/localComparisonEngine.ts": "Generates ticket‑hotel‑VIP‑transport bundles based on matching currencies and computes total costs; also finds cheapest matching transport.",
  "frontend/src/lib/tripWindow.ts": "Calculates check‑in and check‑out timestamps around a concert date as bigint nanoseconds.",
  "frontend/src/lib/upgradeDetection.ts": "Scores bundle components and detects cheaper higher‑quality upgrades for tickets, transport, and hotel rooms.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/AlbumPage.tsx": "Displays a photo album with upload and delete functionality, handling loading and error states.",
  "frontend/src/pages/GroupDetailPage.tsx": "Shows group details and chat, allowing posting messages and leaving the group with confirmation dialogs.",
  "frontend/src/pages/GroupsPage.tsx": "Lists user groups and provides UI to create new groups, with loading states and sign‑in enforcement.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, branding, navigation buttons, and a features overview for concert travel savings.",
  "frontend/src/pages/MemoryFinderPage.tsx": "Displays user photo albums, supports album creation, and requires sign‑in using Internet Identity.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile details and saved trip comparisons with delete options, requiring authentication.",
  "frontend/src/pages/ResultsPage.tsx": "Generates and sorts travel bundles from trip data, displays upgrade info, and allows saving comparisons.",
  "frontend/src/pages/SavedComparisonsPage.tsx": "Lists saved trip comparisons with delete actions and handles unauthenticated and empty states.",
  "frontend/src/pages/SignInPage.tsx": "Redirects signed‑in users to profile and shows an Internet Identity sign‑in screen otherwise.",
  "frontend/src/pages/TripBuilderPage.tsx": "React page for entering event details and offer options, validating inputs, and navigating to results with the trip builder state.",
  "frontend/src/utils/urlParams.ts": "Helpers to read, store, retrieve, and clear URL and sessionStorage parameters with support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling with ESNext modules and composite builds.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variables, path aliases, local API proxying, and validated Internet Identity URL setup.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, known issues, and existing feature definitions."
}