{
  "backend/main.mo": "Defines hotel, ticket, bundle, comparison, and user profile types plus access‑controlled user profile queries in a Motoko actor.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend components, pages, hooks, and logic.",
  "frontend/.env.capacitor.example": "Example Capacitor environment file showing required CAPACITOR_SERVER_URL configuration.",
  "frontend/android/.gitignore": "Gitignore rules for Android project build artifacts, IDE files, and keystores.",
  "frontend/android/app/build.gradle": "Android app Gradle config defining SDK versions, build types, dependencies, and Capacitor plugin setup.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest configuring app metadata, main activity, FileProvider, and required permissions.",
  "frontend/android/app/src/main/java/com/eoatraveldeals/app/MainActivity.java": "Main Capacitor activity extending BridgeActivity with default onCreate.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon definition using shared drawables.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon referencing background and foreground drawables.",
  "frontend/android/app/src/main/res/values/strings.xml": "String resources defining app name, activity title, package name, and URL scheme.",
  "frontend/android/build.gradle": "Top-level Gradle build file defining repositories, plugin classpaths, and a clean task.",
  "frontend/android/gradle.properties": "Project-wide Gradle settings enabling AndroidX and Jetifier with JVM args.",
  "frontend/android/settings.gradle": "Settings file including app and Capacitor Android modules.",
  "frontend/capacitor.config.ts": "Capacitor configuration specifying app metadata, web directory, server URL, and Android options.",
  "frontend/docs/android.md": "Comprehensive Android guide covering PWA install steps, APK build instructions, environment setup, and troubleshooting.",
  "frontend/docs/README.md": "Docs index linking to Android installation guide and instructions for PWA and APK usage.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry file loading the app root and main TypeScript module.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app metadata, icons, shortcuts, and display settings.",
  "frontend/public/offline.html": "Standalone offline fallback page with basic styling and a retry button.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network-first fetch handling with offline fallback.",
  "frontend/src/App.tsx": "Sets up the main app router, routes, theme provider, and registers the service worker.",
  "frontend/src/backend.idl.ts": "Defines the candid IDL schema for backend types including users, groups, albums, hotels, tickets, and comparisons.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling login, logout, navigation, and error states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to set a screen name and save their profile.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard component that restricts access to authenticated users and handles redirects.",
  "frontend/src/components/auth/UnauthSignInScreen.tsx": "Displays a sign‑in screen with branding, login button, and error handling for Internet Identity login.",
  "frontend/src/components/groups/ChatPanel.tsx": "Renders a chat UI with message list, auto‑scrolling, and message input supporting Enter‑to‑send.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper with top nav, footer, route‑based backgrounds, and title/background preloading effects.",
  "frontend/src/components/layout/Footer.tsx": "Shows a footer with copyright, branding, and a referral link to caffeine.ai.",
  "frontend/src/components/layout/TopNav.tsx": "Navigation bar with branding, conditional auth links, mobile menu, and profile access.",
  "frontend/src/components/memory/PhotoGrid.tsx": "Displays photo thumbnails with tagging and delete actions, plus a panel for tagging people.",
  "frontend/src/components/memory/PhotoUploader.tsx": "Handles selecting and uploading photos with progress tracking and validation.",
  "frontend/src/components/memory/TagPeoplePanel.tsx": "Dialog for adding, removing, and saving manual person tags on a photo.",
  "frontend/src/components/offers/HotelOffersEditor.tsx": "UI component to add, edit, and remove hotel offers with room and pricing details.",
  "frontend/src/components/offers/TicketOffersEditor.tsx": "Manages creation, editing, and deletion of ticket offers including type, price, and currency.",
  "frontend/src/components/offers/TransportOffersEditor.tsx": "Editor for adding and removing transportation offers with mode, provider, class, and pricing.",
  "frontend/src/components/offers/VipOffersEditor.tsx": "Handles creation and modification of VIP packages including price, currency, and inclusions.",
  "frontend/src/components/profile/LegalNameSection.tsx": "Displays and updates a user's private legal name with save functionality and loading states.",
  "frontend/src/components/pwa/OfflineStatusBanner.tsx": "Shows a banner indicating offline or restored-online status based on browser connectivity events.",
  "frontend/src/components/results/BundleCard.tsx": "Renders a detailed bundle comparison card with pricing, ticket, hotel, and transport info, highlighting planned or upgraded choices.",
  "frontend/src/components/results/BundleSortBar.tsx": "Provides a dropdown UI for sorting bundles by price or hotel rating.",
  "frontend/src/components/safety/PurchaseConsentGate.tsx": "Gates children behind authentication and parental consent checks, allowing users to confirm permission before viewing purchase options.",
  "frontend/src/config/branding.ts": "Defines app branding values including name, tagline, and logo asset paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth state, login flow, and identity persistence via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, permissions, legal info, friends, and trip-related backend operations.",
  "frontend/src/index.css": "Sets Tailwind base styles, theme variables, dark mode values, and route background styling.",
  "frontend/src/lib/currency.ts": "Formats numbers as fixed‑precision currency strings using Intl.NumberFormat.",
  "frontend/src/lib/localComparisonEngine.ts": "Generates ticket–hotel–VIP–transport bundles with cost calculations and finds the cheapest transport option.",
  "frontend/src/lib/pwa/registerServiceWorker.ts": "Registers a service worker in production and periodically checks for updates.",
  "frontend/src/lib/routeBackgrounds.ts": "Maps routes to background images and resolves inherited backgrounds for nested paths.",
  "frontend/src/lib/tripWindow.ts": "Computes check‑in and check‑out timestamps based on a concert date and buffer days.",
  "frontend/src/lib/upgradeDetection.ts": "Rates bundle components and detects cheaper higher‑quality alternatives for tickets, transport, and rooms.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers.",
  "frontend/src/pages/AlbumPage.tsx": "Displays an album with photo upload, deletion, and navigation handling.",
  "frontend/src/pages/GroupDetailPage.tsx": "Shows group details with chat, leaving the group, and message posting.",
  "frontend/src/pages/GroupsPage.tsx": "Lists user groups, creates new groups, and handles unauthenticated access.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing branding, hero section, feature steps, and navigation buttons to start a trip or view saved trips.",
  "frontend/src/pages/InstallAndroidPage.tsx": "Provides instructions for installing the app on Android via PWA or APK, including steps, alerts, and feature notes.",
  "frontend/src/pages/MemoryFinderPage.tsx": "Lists user photo albums, allows creating new albums, and handles unauthenticated states and loading skeletons.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile info, legal name section, and saved trip comparisons with options to delete entries.",
  "frontend/src/pages/ResultsPage.tsx": "Generates and sorts trip bundles, displays upgrade options, and lets users save a selected comparison.",
  "frontend/src/pages/SavedComparisonsPage.tsx": "Displays saved trip comparisons, handles loading and unauthenticated states, and supports deleting a comparison with confirmation and toast feedback.",
  "frontend/src/pages/SignInPage.tsx": "Redirects authenticated users to their profile and shows the UnauthSignInScreen for sign‑in when no identity is present.",
  "frontend/src/pages/TripBuilderPage.tsx": "Provides a form-driven interface for entering event and travel details, editing offer options, and navigating to results for comparison.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and sessionStorage parameters including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin setup for the frontend.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build files, enabling ESNext modules and composite builds for vite.config.",
  "frontend/vite.config.ts": "Defines Vite setup with React, env handling, path aliases, dev server proxying, and enforced Internet Identity provider URL.",
  "project_state.json": "Tracks project version, branding direction, architecture notes, known issues, and feature inventory for the concert‑travel comparison app."
}