{
  "backend/main.mo": "Defines the backend actor with access control, data models for hotels, tickets, bundles, comparisons, and user profiles, plus profile query logic.",
  "feature_evidence.json": "Contains feature evidence metadata linking features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists human‑written summaries of various frontend files across the project.",
  "frontend/index.css": "Defines Tailwind CSS base layers and light/dark theme CSS variables.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with SignIn as the index route and wraps the app in theme and toaster providers.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity and navigates to profile after sign‑in.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a modal prompting new authenticated users to enter their name and saves the profile via backend hooks.",
  "frontend/src/components/auth/UnauthSignInScreen.tsx": "Displays a branded sign‑in screen with logo, welcome text, and a button triggering Internet Identity login.",
  "frontend/src/components/groups/ChatPanel.tsx": "Renders a chat UI with message list, auto‑scrolling, input box, and send handling with Enter support.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with top nav and footer and sets the document title based on routing and branding.",
  "frontend/src/components/layout/Footer.tsx": "Displays footer with branding, current year, and a referral link to caffeine.ai.",
  "frontend/src/components/layout/TopNav.tsx": "Provides top navigation with branding, route buttons, user profile access, and a mobile menu sheet.",
  "frontend/src/components/memory/PhotoGrid.tsx": "Shows a grid of photos with hover actions for tagging and deletion, and opens a tag panel when selected.",
  "frontend/src/components/memory/PhotoUploader.tsx": "Handles photo uploads with progress tracking, validation, and mutation-based upload flow.",
  "frontend/src/components/memory/TagPeoplePanel.tsx": "Dialog for adding, removing, and saving manual tags on a photo using friends or principal IDs.",
  "frontend/src/components/offers/HotelOffersEditor.tsx": "UI component for adding, editing, and deleting hotel entries with room and price details.",
  "frontend/src/components/offers/TicketOffersEditor.tsx": "Manages creation and modification of ticket options including type, price, and currency.",
  "frontend/src/components/offers/VipOffersEditor.tsx": "Provides form controls to add, edit, and remove VIP packages with pricing and inclusions.",
  "frontend/src/components/results/BundleCard.tsx": "Displays a travel bundle's ticket, hotel, VIP details, and total pricing with ranking badges.",
  "frontend/src/components/results/BundleSortBar.tsx": "Sort bar allowing users to choose sorting options for bundles such as price or hotel rating.",
  "frontend/src/components/safety/PurchaseConsentGate.tsx": "Gates purchase-related UI behind authentication and parental consent checks.",
  "frontend/src/config/branding.ts": "Exports app branding settings including name, tagline, and logo paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, friends, comparisons, groups, and albums.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying global styles.",
  "frontend/src/lib/currency.ts": "Formats numeric amounts into localized currency strings using Intl.NumberFormat.",
  "frontend/src/lib/localComparisonEngine.ts": "Generates travel bundles by combining tickets, hotels, rooms, and optional VIP packages with cost calculations.",
  "frontend/src/lib/tripWindow.ts": "Computes check‑in and check‑out timestamps based on a concert date and buffer days.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AlbumPage.tsx": "Displays an album with its photos, supports uploading photos, and allows deleting the album.",
  "frontend/src/pages/GroupDetailPage.tsx": "Shows group details, chat messages, and members, and allows posting messages and leaving the group.",
  "frontend/src/pages/GroupsPage.tsx": "Lists user groups, handles group creation with a dialog, and redirects unauthenticated users to sign in.",
  "frontend/src/pages/HomePage.tsx": "Displays the marketing homepage with hero content, feature cards, and navigation buttons to start trip building or view saved items.",
  "frontend/src/pages/MemoryFinderPage.tsx": "Shows the user's photo albums, supports creating new albums, and redirects unauthenticated users to sign in.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user's profile and saved trip comparisons with delete functionality, requiring sign‑in to access.",
  "frontend/src/pages/ResultsPage.tsx": "Generates and displays sorted trip bundle results, with options to save comparisons and navigate back to the trip builder.",
  "frontend/src/pages/SavedComparisonsPage.tsx": "Displays saved user comparisons with loading, empty, and authenticated states, and supports deleting comparisons.",
  "frontend/src/pages/SignInPage.tsx": "Redirects authenticated users to their profile and otherwise shows the unauthenticated sign-in screen.",
  "frontend/src/pages/TripBuilderPage.tsx": "Provides a form for building a concert trip with event details and offer editors, then navigates to results for comparison.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, custom animations, and plugin setup.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes for the concert‑travel app."
}