{
  "backend/main.mo": "Defines data models for hotels, tickets, bundles, comparisons, and user profiles with authorization mixin and profile lookup logic.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files describing their purpose and functionality.",
  "frontend/.env.capacitor.example": "Example environment file defining CAPACITOR_SERVER_URL for Android wrapper builds.",
  "frontend/android/.gitignore": "Gitignore rules for Android project build artifacts, IDE files, and keystores.",
  "frontend/android/app/build.gradle": "Android app Gradle config setting SDK versions, dependencies, build types, and Capacitor integration.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest defining app metadata, permissions, and Capacitor MainActivity.",
  "frontend/android/app/src/main/java/com/eoatraveldeals/app/MainActivity.java": "Main Capacitor activity extending BridgeActivity with default onCreate.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon configuration referencing same drawable layers.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon XML defining background and foreground assets.",
  "frontend/android/app/src/main/res/values/strings.xml": "String resources including app name and package identifiers.",
  "frontend/android/build.gradle": "Top-level Gradle build config declaring repositories and Android/Google plugins.",
  "frontend/android/gradle.properties": "Gradle settings enabling AndroidX, Jetifier, and JVM args.",
  "frontend/android/settings.gradle": "Gradle settings including Capacitor modules and project structure.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app ID, name, web build dir, server URL, and Android options.",
  "frontend/docs/android.md": "Detailed Android setup guide covering PWA installation, APK building, environment setup, and troubleshooting.",
  "frontend/docs/README.md": "Intro documentation linking to Android guide for PWA install and APK build instructions.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes, applying global border and body styles.",
  "frontend/index.html": "HTML entry point setting metadata, icons, manifest, and loading the main React script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, theme, icons, categories, and shortcuts.",
  "frontend/public/offline.html": "Standalone offline fallback page with basic styling and a retry button.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network-first fetch handling with offline fallback.",
  "frontend/src/App.tsx": "Sets up app routing, theming, authentication guard, and registers the service worker.",
  "frontend/src/backend.idl.ts": "IDL definitions for backend types including users, groups, albums, hotels, tickets, and comparison input.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and navigation.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to create a screen name and save their profile.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that redirects unauthenticated users to the sign-in page and blocks protected content.",
  "frontend/src/components/auth/UnauthSignInScreen.tsx": "Displays an unauthenticated sign-in screen with branding, messaging, login button, and error alert.",
  "frontend/src/components/groups/ChatPanel.tsx": "Renders a scrollable chat view with message input, send handling, and auto-scrolling behavior.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with background images, top navigation, footer, and route-based title updates.",
  "frontend/src/components/layout/Footer.tsx": "Shows a footer with copyright, branding, and a link to caffeine.ai including the current hostname.",
  "frontend/src/components/layout/TopNav.tsx": "Renders top navigation with branding, auth‑aware nav items, profile access, login button, and mobile menu.",
  "frontend/src/components/memory/PhotoGrid.tsx": "Displays a grid of photos with tag and delete actions, plus a modal for tagging people.",
  "frontend/src/components/memory/PhotoUploader.tsx": "Handles image file selection and upload with progress tracking and success/error toasts.",
  "frontend/src/components/memory/TagPeoplePanel.tsx": "Provides a dialog to add, remove, and save manual person tags on a photo using friends or principal IDs.",
  "frontend/src/components/offers/HotelOffersEditor.tsx": "Provides UI to add, edit, and delete hotel offers with room and price details, managing form state and emitting updates.",
  "frontend/src/components/offers/TicketOffersEditor.tsx": "Manages creation, editing, and removal of ticket offers, including type selection, pricing, and currency handling.",
  "frontend/src/components/offers/TransportOffersEditor.tsx": "Allows users to add and delete transportation offers with mode, provider, class, and price details.",
  "frontend/src/components/offers/VipOffersEditor.tsx": "Handles adding, editing, and removing VIP packages with pricing, inclusions, and optional perks.",
  "frontend/src/components/profile/LegalNameSection.tsx": "Displays and edits a user's private legal name, syncing with backend data and providing save functionality.",
  "frontend/src/components/pwa/OfflineStatusBanner.tsx": "Shows an online/offline status banner by listening to browser connectivity events.",
  "frontend/src/components/results/BundleCard.tsx": "Displays a travel bundle card with pricing, ticket, hotel, transport details, and visual indicators for ranking or special statuses.",
  "frontend/src/components/results/BundleSortBar.tsx": "Provides a sort selector UI for ordering bundles by price or hotel rating.",
  "frontend/src/components/safety/PurchaseConsentGate.tsx": "Gates purchase‑related content behind authentication and parental consent, offering UI to confirm permission.",
  "frontend/src/config/branding.ts": "Defines centralized branding values including app name, tagline, and logo paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the user’s identity, invalidating queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, permissions, friends, legal info, and trip/comparison operations using the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS config defining theme variables and shared layout styles, including route background system.",
  "frontend/src/lib/currency.ts": "Formats numbers into localized currency strings using Intl.NumberFormat.",
  "frontend/src/lib/localComparisonEngine.ts": "Generates ticket-hotel-VIP-transport bundles with cost calculations and finds cheapest transport options.",
  "frontend/src/lib/pwa/registerServiceWorker.ts": "Registers a service worker in production and periodically checks for updates.",
  "frontend/src/lib/routeBackgrounds.ts": "Maps routes to background images and resolves backgrounds with nested route inheritance.",
  "frontend/src/lib/tripWindow.ts": "Computes check-in and check-out timestamps around a concert date using days before/after.",
  "frontend/src/lib/upgradeDetection.ts": "Evaluates bundles to find cheaper higher-quality upgrades for tickets, transport, and hotel rooms.",
  "frontend/src/main.tsx": "Sets up React app rendering with React Query and Internet Identity provider.",
  "frontend/src/pages/AlbumPage.tsx": "Displays an album with photos, supports uploading and deleting the album.",
  "frontend/src/pages/GroupDetailPage.tsx": "Shows group details, chat messages, and allows posting messages or leaving the group.",
  "frontend/src/pages/GroupsPage.tsx": "Lists user groups, supports group creation, and navigates to individual group pages.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing branding, hero section, and feature steps with navigation to trip builder and saved comparisons.",
  "frontend/src/pages/MemoryFinderPage.tsx": "Displays user photo albums with creation flow; requires authentication and supports adding new albums.",
  "frontend/src/pages/ProfilePage.tsx": "User profile dashboard showing identity details, legal name section, and saved trip comparisons with delete support.",
  "frontend/src/pages/ResultsPage.tsx": "Generates and sorts travel bundles from trip data, allows selecting and saving a bundle with upgrade detection.",
  "frontend/src/pages/SavedComparisonsPage.tsx": "Shows authenticated users their saved trip comparisons with loading states and deletion options.",
  "frontend/src/pages/SignInPage.tsx": "Redirects signed‑in users to profile and shows an authentication prompt for unsigned users.",
  "frontend/src/pages/TripBuilderPage.tsx": "React page for entering event details and selecting ticket, VIP, hotel, and transport options, then navigating to results if required fields are filled.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build files, enabling ESNext modules and including vite.config.ts.",
  "frontend/vite.config.ts": "Vite setup for React with env loading, aliasing, dev server proxying, optimized deps, and enforced Internet Identity URL.",
  "project_state.json": "Metadata describing project goals, branding, architectural notes, issues, and required assets for the app."
}