{
  "backend/main.mo": "Defines an actor with access control, extensive travel comparison, hotel, ticket, VIP, and user profile types, and early profile query logic using a Map store.",
  "feature_evidence.json": "Feature evidence report listing three UI background‑related features and their associated source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining base theme variables for light and dark modes and applying background and text styles to the body.",
  "frontend/index.html": "Base HTML entry point that sets the page title and loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes wrapped in AppLayout and RequireAuth, initializes theme provider, and renders the router with notifications.",
  "frontend/src/backend.idl.ts": "IDL factory defining all backend Motoko types for frontend canister communication, including users, groups, albums, hotels, tickets, and comparisons.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout, navigation, cache clearing, and showing the profile setup dialog.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to set a public screen name and saves it via mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guards protected routes by redirecting unauthenticated users to the sign‑in page.",
  "frontend/src/components/auth/UnauthSignInScreen.tsx": "Displays a sign‑in screen with branding, login button, and error handling for Internet Identity login.",
  "frontend/src/components/groups/ChatPanel.tsx": "Renders a scrollable chat view with message sending, input handling, and timestamp formatting.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout providing navigation, footer, dynamic backgrounds, and document title updates.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing branding, current year, and a link to caffeine.ai with dynamic host identifier.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar showing branded logo, authenticated nav items, profile access, and mobile menu.",
  "frontend/src/components/memory/PhotoGrid.tsx": "Displays photos in a grid with hover actions for tagging and deletion, plus delete confirmation dialogs.",
  "frontend/src/components/memory/PhotoUploader.tsx": "Handles image file selection and upload with progress tracking and toast notifications.",
  "frontend/src/components/memory/TagPeoplePanel.tsx": "UI panel for adding, removing, and saving manual photo tags using friend selection or principal IDs.",
  "frontend/src/components/offers/HotelOffersEditor.tsx": "Editor for adding, editing, and deleting hotel entries with room and pricing details.",
  "frontend/src/components/offers/TicketOffersEditor.tsx": "Manages creation, editing, and removal of ticket options with type, price, and currency.",
  "frontend/src/components/offers/TransportOffersEditor.tsx": "Allows adding and removing transportation offers with mode, provider, class, and price.",
  "frontend/src/components/offers/VipOffersEditor.tsx": "Editor for VIP package entries including name, price, currency, inclusions, and perks.",
  "frontend/src/components/profile/LegalNameSection.tsx": "Form for viewing and updating a user's private legal name with save functionality.",
  "frontend/src/components/results/BundleCard.tsx": "UI card displaying a travel bundle’s price, ticket, hotel, transport details, and special flags like VIP or planned choice.",
  "frontend/src/components/results/BundleSortBar.tsx": "Sort bar component allowing users to choose sorting options like price or hotel rating.",
  "frontend/src/components/safety/PurchaseConsentGate.tsx": "Gate component requiring authentication and parental consent before showing purchasing-related content.",
  "frontend/src/config/branding.ts": "Central branding config defining the app name, tagline, and logo assets.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for profiles, permissions, friends, legal info, and comparisons.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables, dark mode, and route background layout rules.",
  "frontend/src/lib/currency.ts": "Utility function for formatting numbers as localized currency strings.",
  "frontend/src/lib/localComparisonEngine.ts": "Generates trip bundles combining tickets, hotels, VIP packages, and transport with currency checks, and finds cheapest transport options.",
  "frontend/src/lib/routeBackgrounds.ts": "Maps routes to background images and resolves backgrounds with support for nested route inheritance.",
  "frontend/src/lib/tripWindow.ts": "Computes check‑in and check‑out timestamps based on concert date and stay duration.",
  "frontend/src/lib/upgradeDetection.ts": "Detects upgrade opportunities across tickets, transport, and hotel rooms by comparing quality and price against a baseline bundle.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AlbumPage.tsx": "Displays an album with delete, upload, and photo grid functionality using route params and album queries.",
  "frontend/src/pages/GroupDetailPage.tsx": "Shows group details, chat, and leave‑group actions, handling message posting and membership logic.",
  "frontend/src/pages/GroupsPage.tsx": "Lists user groups, supports creating new groups, and handles sign‑in gating and loading states.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content, branding, and feature cards, linking to trip builder and saved comparisons.",
  "frontend/src/pages/MemoryFinderPage.tsx": "Authenticated page for viewing and creating photo albums, with album creation dialog and loading/unauth states.",
  "frontend/src/pages/ProfilePage.tsx": "User profile dashboard showing identity info, legal name section, and saved trip comparisons with delete support.",
  "frontend/src/pages/ResultsPage.tsx": "Displays generated trip bundles with sorting, upgrade detection, bundle selection, and save-comparison functionality.",
  "frontend/src/pages/SavedComparisonsPage.tsx": "Lists saved trip comparisons with delete actions, handling loading, empty state, and unauthenticated access.",
  "frontend/src/pages/SignInPage.tsx": "Redirects signed-in users to profile and shows a sign‑in screen for unauthenticated users.",
  "frontend/src/pages/TripBuilderPage.tsx": "React page for entering event and travel details, managing trip builder state, and navigating to results after validation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and required plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite setup for React with environment loading, aliases, dev server proxy, build options, and II_URL validation.",
  "project_state.json": "Project metadata describing app goals, architecture notes, known issues, and required image assets."
}