{
  "kind": "build_request",
  "title": "Retry build/deploy: diagnose deployment failure and restore successful deployment",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-70",
      "text": "Re-run the full build and deploy for the current project, identify the exact cause of the previous deployment failure, and implement the minimum necessary code/config changes so the project deploys successfully again.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Try again"
        ]
      },
      "acceptanceCriteria": [
        "A clean build completes successfully for both frontend and backend (no TypeScript/Vite build errors; no Motoko compile errors).",
        "Deployment completes successfully and produces a reachable app that loads without a blank screen.",
        "If the deployment failure is caused by configuration, the repo contains a safe default/fallback so missing or invalid values fail gracefully (no crash on startup).",
        "All changes are limited to what is necessary to make the build/deploy succeed; no unrelated feature work is introduced."
      ]
    },
    {
      "id": "REQ-71",
      "text": "Add a clear, English error surface for any startup/runtime failure that would prevent the app from loading (e.g., failed service worker registration or initialization errors), so deployment issues are visible and actionable rather than silent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Try again"
        ]
      },
      "acceptanceCriteria": [
        "When a critical initialization step fails (e.g., service worker registration), an English error message is logged and a visible non-blocking UI message is shown somewhere appropriate (e.g., a toast or alert), rather than failing silently.",
        "User-facing error text remains in English and does not contain garbled characters."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; keep all logic in backend/main.mo and introduce backend/migration.mo only if state migration is required.",
    "Do not edit files under frontend/src/components/ui or any frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx). Compose existing components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new product features unrelated to restoring successful build/deploy.",
    "Do not change routes, branding, or authentication behavior unless it is required to fix the deployment failure.",
    "Do not introduce any new backend services, databases, or third-party auth providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}