{
  "kind": "build_request",
  "title": "Provide a downloadable Android app experience (APK + install guidance) for EOATravelDeals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-64",
      "text": "Add a clear in-app entry point that explains how to install EOATravelDeals on a phone as a downloadable app, offering both (1) PWA installation from Android Chrome and (2) a developer/testing option to install a sideloaded debug APK built from the existing Capacitor Android wrapper.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I don't want to app web page I want to downloadable app that you can download onto your phone and use"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated and authenticated users can find an in-app link or section labeled in clear English (e.g., “Install on Android”)",
        "The in-app instructions include both paths: “Install as an app (recommended)” via PWA and “Downloadable APK (developer/testing)” via Capacitor build",
        "The in-app instructions do not mention any non-Internet-Identity sign-in methods (no Google/Instagram/email auth references)",
        "All user-facing text added/modified for this entry point is in English"
      ]
    },
    {
      "id": "REQ-65",
      "text": "Ensure the repository documentation remains accurate and complete for producing a downloadable Android APK from the existing Capacitor wrapper, including the required environment variable configuration and the exact APK output path.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I don't want to app web page I want to downloadable app that you can download onto your phone and use"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/docs/android.md` includes (and keeps) explicit steps to set `CAPACITOR_SERVER_URL` via a `.env.capacitor` file copied from `frontend/.env.capacitor.example`",
        "The docs explicitly state that the Capacitor server URL must be HTTPS for Internet Identity to work",
        "The docs explicitly state the debug APK output path: `android/app/build/outputs/apk/debug/app-debug.apk`",
        "Documentation is clear English and consistent with the current app name “EOATravelDeals”"
      ]
    }
  ],
  "constraints": [
    "Do not add or rely on any authentication provider other than Internet Identity.",
    "Do not edit files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not introduce any external backend services or databases; keep the existing Internet Computer canister architecture unchanged."
  ],
  "nonGoals": [
    "Publishing to the Google Play Store (AAB signing, Play Console setup, store listing)",
    "Building an iOS native wrapper/app",
    "Adding push notifications or real-time socket features"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}