{
  "kind": "build_request",
  "title": "Unique world-landscape background image per page/route",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-58",
      "text": "Add a per-route background system so each main page shows a different world landscape background image behind the page content (unique background per page the user clicks on). Apply this at the shared layout level (AppLayout) so it works consistently across routes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "I want a different background  for each page you click on  different landscape from around the world"
        ]
      },
      "acceptanceCriteria": [
        "Each of these routes renders a distinct background image: /, /home, /trip-builder, /results, /saved, /memory-finder, /groups, /profile.",
        "Nested routes reuse a sensible parent background (unless explicitly overridden): /memory-finder/$albumId uses the Memory Finder background; /groups/$groupId uses the Groups background.",
        "Backgrounds are visually behind the existing UI (TopNav, page content, Footer) and do not break layout sizing (still full height).",
        "Backgrounds render responsively (cover/center) without stretching artifacts, and remain performant (no visible jank when navigating)."
      ]
    },
    {
      "id": "REQ-59",
      "text": "Ensure foreground content remains readable on top of landscape backgrounds by adding a consistent dark overlay/tint (or equivalent) that preserves the existing dark theme look while still letting the landscape be visible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "different landscape from around the world"
        ]
      },
      "acceptanceCriteria": [
        "All pages keep sufficient text contrast (headings, body text, buttons, cards) against the background image.",
        "Cards and surfaces remain visually distinct from the background (no loss of boundaries).",
        "The overlay/tint approach is consistent across all routes and does not introduce new non-English user-facing text."
      ]
    },
    {
      "id": "REQ-60",
      "text": "Add the new landscape background images as static assets under frontend/public/assets/generated and wire the route-to-background mapping to those exact filenames (no backend image serving).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "different landscape from around the world"
        ]
      },
      "acceptanceCriteria": [
        "All new background image files exist in frontend/public/assets/generated and are referenced via absolute paths like /assets/generated/<filename>.",
        "No backend changes are required to display backgrounds.",
        "Build passes and all routes render their intended backgrounds in production mode."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/components/ui/*).",
    "Keep all user-facing text in English.",
    "Serve backgrounds as static frontend assets (frontend/public/assets/generated); do not route image generation or fetching through the backend."
  ],
  "nonGoals": [
    "Do not implement dynamic/background rotation based on user location, time, or external APIs.",
    "Do not add third-party image/CDN dependencies.",
    "Do not change routes or add new routes solely for backgrounds.",
    "Do not modify authentication gating behavior (protected routes should remain protected)."
  ],
  "imageRequirements": {
    "required": [
      "World landscape background: alpine mountains at sunrise, wide scenic vista (bg-signin-alps-sunrise.dim_1920x1080.png)",
      "World landscape background: Tokyo night skyline with neon lights, cinematic wide shot (bg-home-tokyo-night.dim_1920x1080.png)",
      "World landscape background: Santorini cliffside and Aegean sea, bright daylight (bg-tripbuilder-santorini.dim_1920x1080.png)",
      "World landscape background: New York City skyline at golden hour, wide panorama (bg-results-nyc-goldenhour.dim_1920x1080.png)",
      "World landscape background: Sahara desert dunes at sunset with dramatic shadows (bg-saved-sahara-sunset.dim_1920x1080.png)",
      "World landscape background: Iceland waterfall with mist and basalt cliffs, moody overcast (bg-memoryfinder-iceland-waterfall.dim_1920x1080.png)",
      "World landscape background: Norwegian fjord with steep green cliffs and calm water, soft daylight (bg-groups-norway-fjord.dim_1920x1080.png)",
      "World landscape background: Machu Picchu mountains with clouds, early morning atmosphere (bg-profile-machu-picchu.dim_1920x1080.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}