{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Android install entry point + accurate Capacitor APK documentation for EOATravelDeals",
  "requirements": [
    {
      "id": "REQ-64",
      "summary": "Add an in-app “Install on Android” entry point with English instructions for PWA install (recommended) and a debug APK sideload option via the existing Capacitor Android wrapper.",
      "acceptanceCriteria": [
        "Unauthenticated and authenticated users can find an in-app link or section labeled in clear English (e.g., “Install on Android”)",
        "The in-app instructions include both paths: “Install as an app (recommended)” via PWA and “Downloadable APK (developer/testing)” via Capacitor build",
        "The in-app instructions do not mention any non-Internet-Identity sign-in methods (no Google/Instagram/email auth references)",
        "All user-facing text added/modified for this entry point is in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/InstallAndroidPage.tsx",
          "operation": "create",
          "description": "Create an “Install on Android” page that presents two clearly separated sections: (1) PWA installation steps for Android Chrome (recommended) and (2) developer/testing guidance for building and sideloading the existing Capacitor debug APK, including a note that Internet Identity requires HTTPS for the server URL. Use existing shadcn-ui components (e.g., Card, Button, Alert) for layout/clarity; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire a new route (e.g., \"/install-android\") to the new InstallAndroidPage so it is reachable in-app."
        },
        {
          "path": "frontend/src/components/auth/RequireAuth.tsx",
          "operation": "modify",
          "description": "Allow unauthenticated access to the new \"/install-android\" route (similar to the existing sign-in route exception) so both unauthenticated and authenticated users can view the install guidance."
        },
        {
          "path": "frontend/src/components/layout/TopNav.tsx",
          "operation": "modify",
          "description": "Add a persistent navigation item labeled exactly “Install on Android” that is visible to both unauthenticated and authenticated users (desktop nav + mobile sheet). Use existing shadcn-ui Button/Sheet patterns for nav consistency; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/routeBackgrounds.ts",
          "operation": "modify",
          "description": "Add a route background mapping for \"/install-android\" (reuse an existing generated background already in the project) so the new page fits the existing route-based background system."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Keep Android APK build documentation accurate for the existing Capacitor wrapper, including .env.capacitor configuration, HTTPS requirement for Internet Identity, and the exact debug APK output path.",
      "acceptanceCriteria": [
        "`frontend/docs/android.md` includes (and keeps) explicit steps to set `CAPACITOR_SERVER_URL` via a `.env.capacitor` file copied from `frontend/.env.capacitor.example`",
        "The docs explicitly state that the Capacitor server URL must be HTTPS for Internet Identity to work",
        "The docs explicitly state the debug APK output path: `android/app/build/outputs/apk/debug/app-debug.apk`",
        "Documentation is clear English and consistent with the current app name “EOATravelDeals”"
      ],
      "file_operations": [
        {
          "path": "frontend/docs/android.md",
          "operation": "modify",
          "description": "Audit and update the guide to explicitly reference copying `frontend/.env.capacitor.example` to `frontend/.env.capacitor`, reiterate that `CAPACITOR_SERVER_URL` must be HTTPS for Internet Identity, and clearly call out the debug APK output path `android/app/build/outputs/apk/debug/app-debug.apk` in a dedicated, easy-to-find line/section. Ensure naming is consistently “EOATravelDeals” and text is English."
        },
        {
          "path": "frontend/docs/README.md",
          "operation": "modify",
          "description": "Ensure the documentation index remains accurate and continues to link users/developers to the correct sections of `android.md` for PWA installation and debug APK build/sideload steps, using consistent “EOATravelDeals” naming."
        }
      ]
    }
  ]
}