{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore successful frontend build/deploy and add visible startup failure surfacing",
  "requirements": [
    {
      "id": "REQ-70",
      "summary": "Make minimal frontend config/runtime adjustments to prevent deploy-time blank screens and ensure the frontend build reliably succeeds with safe fallbacks for missing/invalid configuration.",
      "acceptanceCriteria": [
        "A clean build completes successfully for both frontend and backend (no TypeScript/Vite build errors; no Motoko compile errors).",
        "Deployment completes successfully and produces a reachable app that loads without a blank screen.",
        "If the deployment failure is caused by configuration, the repo contains a safe default/fallback so missing or invalid values fail gracefully (no crash on startup).",
        "All changes are limited to what is necessary to make the build/deploy succeed; no unrelated feature work is introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/vite.config.ts",
          "operation": "modify",
          "description": "Harden build/runtime environment injection to avoid production-only runtime failures (e.g., missing/undefined env values or \"process is not defined\" crashes). Ensure safe defaults/fallbacks are always present for configuration used by the app (notably Internet Identity URL) and add minimal shims via Vite `define` only as needed to prevent startup crashes."
        },
        {
          "path": "frontend/src/lib/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "Make service worker registration resilient across deployment base paths and hosting setups by registering using the Vite base URL rather than a hard-coded absolute path, and by exposing a small callback-based API so the app can react to registration failures without breaking startup."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the improved service worker registration helper into app startup and ensure failures cannot cause a blank screen (handle registration errors via the new callback and keep the app rendering normally)."
        }
      ]
    },
    {
      "id": "REQ-71",
      "summary": "Add a visible, English startup/runtime error surface so critical initialization failures are actionable rather than silent.",
      "acceptanceCriteria": [
        "When a critical initialization step fails (e.g., service worker registration), an English error message is logged and a visible non-blocking UI message is shown somewhere appropriate (e.g., a toast or alert), rather than failing silently.",
        "User-facing error text remains in English and does not contain garbled characters."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/pwa/StartupErrorBanner.tsx",
          "operation": "create",
          "description": "Create a small, non-blocking banner/alert component that listens for critical startup/runtime failures (global `error` and `unhandledrejection`) and renders a clear English message while also logging details to the console for diagnostics."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Render the new StartupErrorBanner in the global layout so critical errors are visible on every route without changing routing behavior."
        },
        {
          "path": "frontend/src/lib/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "On service worker registration failure, log a clear English error to the console and invoke the provided failure callback so the UI can display a visible non-blocking message instead of failing silently."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Pass a failure callback into service worker registration that triggers the app-wide error surface (banner state) with an English message (e.g., \"Service worker registration failed. The app may not work offline.\")."
        }
      ]
    }
  ]
}