{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Default `/` route to Sign-In screen with “Welcome to EOA” and post-login redirect",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Change the `/` (index) route to render a dedicated sign-in page instead of the current Home/Landing page while keeping all other routes unchanged.",
      "acceptanceCriteria": [
        "When a user visits `/`, the app shows a sign-in page (not the current Home/Landing page).",
        "All other existing routes (e.g., `/trip-builder`, `/saved`, `/memory-finder`, `/groups`, `/profile`) remain unchanged and reachable via navigation or direct URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the TanStack Router index route (`/`) to render the new dedicated SignInPage component instead of HomePage, without changing any other route paths."
        },
        {
          "path": "frontend/src/pages/SignInPage.tsx",
          "operation": "create",
          "description": "Create a dedicated sign-in page component for `/` that displays the unauthenticated sign-in UI (reuse the existing UnauthSignInScreen component) and serves as the new default first screen."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Ensure the `/` sign-in page shows the exact heading \"Welcome to EOA\", starts Internet Identity login via a Sign In button, and redirects to `/profile` after successful login.",
      "acceptanceCriteria": [
        "The sign-in page at `/` visibly displays the heading text exactly: \"Welcome to EOA\".",
        "No extra or garbled characters appear in the welcome heading text.",
        "Clicking \"Sign In\" on the `/` page initiates Internet Identity login.",
        "After a successful login from the `/` page, the user is navigated to `/profile`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignInPage.tsx",
          "operation": "modify",
          "description": "Implement sign-in behavior using the existing Internet Identity hook (per the selected \"authorization\" component guidance). Render UnauthSignInScreen (which already includes the exact \"Welcome to EOA\" heading and a Sign In button that calls `login`), and add a redirect to `/profile` when authentication becomes available. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}